public class Baidu {

    /*
    * 搬家
时间限制： 3000MS
内存限制： 589824KB
题目描述：
小明打算搬家，他需要把房间的东西收拾好装上车，为了固定物品，他需要很多的绳子。由于绳子太长了会浪费，太短了不够用，而且不同的绳子尽量一样的长，方便捆绑。小明有n根绳子，他希望对这些绳子进行加工，每根绳子最多可以切割一次。他的目的是希望最终可以得到最多根长度相同的绳子。你能帮他计算结果么？



输入描述
第一行一个整数n，表示绳子的数量，1<=n<=100000

第二行n个空格隔开的整数，分别表示每根绳子的长度，数字范围[1,100000]

输出描述
一行一个整数，最多可以得到多少根长度相同的绳子。
    *
    * */


    /*
    *
    *
    * 时间限制： 3000MS
内存限制： 589824KB
题目描述：
小明是一支武装部队的统帅，现在他得到命令需要攻击一个据点，他需要集结自己的部队出征。他手里一共有n个士兵，第i个士兵的攻击力为a[i]，防守力为b[i]。他希望从这些士兵中挑选一部分士兵出来，使得攻击力的和加上防守力的和最大化，同时部队整体上不能有缺陷，所以攻击力的和不能小于0，防守力的和也不能小于0。如果找不到这样的士兵，小明则亲自出征，攻击力0防守力0。你能帮助小明计算一下部队最终的攻击力防守力和么？



输入描述
第一行一个整数n，表示士兵的数量，1<=n<=100

接下来n行，每行两个空格隔开的整数a,b，分别表示士兵的攻击力和防守力，大小范围[-1000,1000]

输出描述
一行一个整数，表示部队攻击力和防守力的和。*/
}
